Repository: alexclassroom/external-files-in-media-library
Catalog: languages/external-medias-library-*.po
Languages: de_de

source: External files in Media Library
de_de: Externe Dateien in der Medienbibliothek

source: Enables the Media Library to use external files.
de_de: Ermöglicht es der Medienbibliothek, externe Dateien zu verwenden.

source: Dismiss this notice.
de_de: Diesen Hinweis ausblenden.

source: URL %1$s successfully added in media library.
de_de: URL %1$s erfolgreich in Medienbibliothek hinzugefügt.

source: URL %1$s could not be saved because of this error: %2$s
de_de: Die URL %1$s konnte wegen dieses Fehlers nicht gespeichert werden: %2$s

source: Given string %s is not a valid url starting with http.
de_de: Die angegebene Zeichenkette %s ist keine gültige Url, die mit http beginnt.

source: Given string %s is not a valid url.
de_de: Die angegebene Zeichenkette %s ist keine gültige Url.

source: Given url %s already exist in media library.
de_de: Die angegebene URL %s existiert bereits in der Medienbibliothek.

source: Given URL %s is not available.
de_de: Die angegebene URL %s ist nicht verfügbar.

source: Given URL %1$s response with http-status %2$d.
de_de: Die angegebene URL %1$s antwortet mit dem http-status %2$d.

source: Given URL %s response without Content-type.
de_de: Die angegebene URL %s verfügt über keinen Content-Type.

source: Given URL %1$s response with a not allowed mime-type %2$s.
de_de: Die angegebene URL %1$s antwortet mit einem nicht zulässigen Content-type %2$s.

source: Given URL %1$s is available.
de_de: Die angegebene URL %1$s ist nicht erreichbar.

source: URL %1$s has been deleted from media library.
de_de: Die URL %1$s wurde aus der Medienbibliothek gelöscht.

source: Error creating cache directory.
de_de: Fehler beim Erstellen des Cache-Verzeichnisses.

source: Mime-Type not allowed
de_de: Content-type ist nicht erlaubt.

source: date
de_de: Datum

source: state
de_de: Status

source: General Settings
de_de: Allgemeine Einstellungen

source: Each file in media library has a attachment page which could be called in frontend. With this option you can disable this attachment page for files with URLs.
de_de: Jede Datei in der Medienbibliothek hat eine Anhangseite, die im Frontend aufgerufen werden kann. Mit dieser Option können Sie diese Anhangsseite für Dateien mit URLs deaktivieren.

source: This is handled by Yoast SEO.
de_de: Das wird durch Yoast SEO übernommen.

source: Disable the attachment page for URL-files
de_de: Deaktivieren Sie die Anhangseite für URL-Dateien

source: Disable the check
de_de: Deaktiviere die Prüfung

source: Set interval for file-check
de_de: Intervall für die Dateiprüfung festlegen

source: Defines the time interval in which files with URLs are automatically checked for its availability.
de_de: Legt das Zeitintervall fest, in dem Dateien mit URLs automatisch auf ihre Verfügbarkeit geprüft werden.

source: Select allowed mime-types
de_de: Erlaubte Content-Types auswählen

source: Choose the mime-types you wish to allow as external URL. If you change this setting, already used external files will not change their accessibility in frontend.
de_de: Wählen Sie die Content-Types, die Sie als externe URL zulassen möchten. Wenn Sie diese Einstellung ändern, werden bereits verwendete externe Dateien im Frontend nicht mehr zugänglich sein.

source: log warnings
de_de: Warnungen loggen

source: log all
de_de: alles loggen

source: Delete all data on deinstallation
de_de: Löschen aller Daten bei Deinstallation

source: If this option is enabled all URL-files will be deleted during deinstallation of this plugin.
de_de: Wenn diese Option aktiviert ist, werden alle URL-Dateien bei der Deinstallation des Plugins gelöscht.

source: Adding files
de_de: Hinzufügen von Dateien

source: Select user roles
de_de: Benutzerrollen auswählen

source: Select roles which should be allowed to add external files.
de_de: Wählen Sie die Rollen aus, denen es erlaubt sein soll, externe Dateien hinzuzufügen.

source: User new files should be assigned to
de_de: Benutzer dem neue Dateien zugewiesen werden

source: This is only a fallback if the actual user is not available (e.g. via CLI-import). New files are normally assigned to the user who add them.
de_de: Dies ist nur ein Fallback, wenn der eigentliche Benutzer nicht verfügbar ist (z. B. über CLI-Import). Neue Dateien werden normalerweise dem Benutzer zugewiesen, der sie hinzugefügt hat.

source: Images Settings
de_de: Bild-Einstellungen

source: Mode for image handling
de_de: Modus für Bild-Bearbeitung

source: Defines how external images are handled.
de_de: Legt fest, wie externe Bilder behandelt werden.

source: host them extern
de_de: extern hosten

source: download and host them local
de_de: runterladen und lokal hosten

source: Enable proxy for images
de_de: Aktiviere Proxy für Bilder

source: This option is only available if images are hosted external. If this option is disabled, external images will be embedded with their external URL. To prevent privacy protection issue you could enable this option to load the images locally.
de_de: Diese Option ist nur verfügbar, wenn die Bilder extern gehostet werden. Wenn diese Option deaktiviert ist, werden die externen Bilder mit ihrer externen URL eingebettet. Um Probleme mit dem Datenschutz zu vermeiden, können Sie diese Option aktivieren, um die Bilder lokal zu laden.

source: Max age for cached images in proxy in hours
de_de: Höchstalter für zwischengespeicherte Bilder im Proxy in Stunden

source: Defines how long images, which are loaded via our own proxy, are saved locally. After this time their cache will be renewed.
de_de: Legt fest, wie lange Bilder, die über unseren eigenen Proxy geladen werden, lokal gespeichert werden. Nach dieser Zeit wird ihr Cache erneuert.

source: Settings for External files in Media Library
de_de: Einstellungen für externe Dateien in der Medienbibliothek

source: External files in Medias Library
de_de: Externe Dateien in der Mediathek

source: Add external URL
de_de: Externe URL hinzufügen

source: Add this URL
de_de: Diese URL hinzufügen

source: Add external files <a href="%1$s">here</a>.
de_de: Füge externe Dateien <a href="%1$s">hier</a> hinzu.

source: No URLs given to import.
de_de: Keine URL für den Import angegeben.

source: The given URL <a href="%1$s">has been saved</a> in media library.
de_de: Die angegebene URL <a href="%1$s">wurde in der Medienbibliothek gespeichert</a>.

source: The following URLs has been saved in media library: %1$s
de_de: Die folgenden URLs wurden in der Medien-Bibiliothek gespeichert: %1$s

source: <p>Following URL could not be saved in the media library:</p>%1$s<p>Details are visible <a href="%2$s">in the log</a>.</p>
de_de: <p>Folgende URL konnte nicht in der Mediathek gespeichert werden:</p>%1$s<p>Details sind <a href="%2$s">im Protokoll</a> nachzulesen.</p>

source: All files
de_de: Alle Dateien

source: only external URLs
de_de: nur externe URLs

source: no external URLs
de_de: nur nicht externe URLs

source: External file
de_de: Externe Datei

source: File-URL:
de_de: Datei-URL:

source: File-URL is available.
de_de: Datei-URL ist erreichbar.

source: File-URL is NOT available! Check <a href="%1$s">the log</a> for details.
de_de: Datei-URL ist nicht erreichbar. Prüfe <a href="%1$s">das Log</a> für Details dazu.

source: Recheck availability
de_de: Verfügbarkeit prüfen

source: This file is local hostet.
de_de: Die Datei ist lokal gehostet.

source: This file is extern hostet.
de_de: Die Datei ist extern gehostet.

source: This file is delivered through proxied cache.
de_de: Diese Datei wird über einen Proxy-Cache bereitgestellt.

source: This file is not cached in proxy.
de_de: Die Datei ist keine über den Proxy gecachte Datei.

source: This file is not an external file.
de_de: Die Datei ist keine externe Datei.

source: No ID given.
de_de: Keine ID angegeben.

source: URL-File is NOT available! Check <a href="%1$s">the log</a> for details.
de_de: URL-Datei ist nicht erreichbar. Prüfe <a href="%1$s">das Log</a> für Details dazu.

source: The given interval does not exists.
de_de: Das angegebene Intervall existiert nicht.

source: The given mime-type is not supported. Setting will not be saved.
de_de: Der angegebene Content-type wird nicht Unterstützung. Einstellung wird nicht gespeichert.

source: External files could not be used as no mime-types are allowed.
de_de: Externe Dateien konnten nicht verwendet werden, da deren Content-type nicht erlaubt ist.
